---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AssemblyRenameTypeWarn
source: html/97cbaec4-b44f-6189-d9de-450c7187d1fe.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AssemblyRenameTypeWarn Property

Edits to these assemblies changed the naming category and name of these assemblies.

## Syntax (C#)
```csharp
public static FailureDefinitionId AssemblyRenameTypeWarn { get; }
```